{
  "backend/main.mo": "Motoko actor defining the backend for a job training academy, with full CRUD for courses and enrollment management (create, read, update, delete, mark-paid) using in-memory Maps and auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (home page, courses page, course detail, checkout flow, admin dashboard, contact page) to the frontend/backend files and test IDs that implement them.",
  "frontend-file-summaries.txt": "A JSON document containing one-sentence summaries of every frontend source file, serving as a human-readable index of the frontend codebase.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes, applied globally to background and border utilities.",
  "frontend/index.html": "Minimal HTML entry point titled 'Job Training Academy' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all application routes (home, courses, course detail, checkout, thank-you, contact, admin) wrapped in a shared Layout component containing Navigation and Footer.",
  "frontend/src/components/CourseForm.tsx": "Reusable form component for creating and editing courses, with dynamic syllabus list management, field validation, and create/update mutation calls via React Query hooks.",
  "frontend/src/components/Footer.tsx": "Navy-styled site footer with brand info, quick navigation links, clickable contact details, and social media icon links to Facebook, X, LinkedIn, and Instagram.",
  "frontend/src/components/Navigation.tsx": "Responsive sticky navigation bar for SkillUp Academy with desktop and mobile (hamburger) menus, active link highlighting, and an 'Enroll Now' CTA button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including CRUD operations for courses and enrollments, and marking enrollment payments as paid.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS layers, defines OKLCH-based CSS custom properties for light/dark themes, and declares reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page displaying stats, a course management table with add/edit/delete actions, and an enrollments table with payment status management using tabbed navigation.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects student name, email, and phone number to enroll in a course, with form validation and submission via the createEnrollment mutation, then redirects to the thank-you page.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form for name, email, phone, and message that simulates submission and shows a success state, alongside contact info and WhatsApp link.",
  "frontend/src/pages/CourseDetail.tsx": "Course detail page that fetches and displays a single course's full description, syllabus, trainer info, and pricing, with a sidebar enroll CTA and loading/error states.",
  "frontend/src/pages/Courses.tsx": "Courses listing page that fetches all courses, supports client-side search filtering, and renders a responsive card grid with loading skeletons and empty states.",
  "frontend/src/pages/Home.tsx": "Home landing page featuring a hero banner, stats bar, featured courses section, and testimonials, pulling the first three courses from the API.",
  "frontend/src/pages/ThankYou.tsx": "Post-enrollment confirmation page that displays the enrolled course name from query params and shows next-step instructions for email confirmation and payment.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining custom colors (navy, grey, sky-accent), fonts (Inter, Poppins), shadows, border radii, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 3) describing the Job Training Academy website's features, architecture, known issues, and image requirements, tracking implemented features like home page, courses listing, course detail, enrollment flow, and admin dashboard."
}